NeuralNetworkLayerMonk(
  (layer1): Linear(in_features=6, out_features=3, bias=True)
  (dropout1): Dropout(p=0.5, inplace=False)
  (bn1): BatchNorm1d(3, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  (layer2): Linear(in_features=3, out_features=1, bias=True)
)
