NeuralNetworkLayer(
  (layer1): Linear(in_features=10, out_features=50, bias=True)
  (layer2): Linear(in_features=50, out_features=100, bias=True)
  (layer3): Linear(in_features=100, out_features=100, bias=True)
  (layer4): Linear(in_features=100, out_features=50, bias=True)
  (layer5): Linear(in_features=50, out_features=3, bias=True)
)
